# A3-Descriptive Statistics - Measures of Central Tendency and variability

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('employee_data.csv')

In [3]:
data

     Unnamed: 0   id groups  age  healthy_eating  active_lifestyle  salary
0             0    0      A   36               5                 5    2297
1             1    1      A   55               3                 5    1134
2             2    2      A   61               8                 1    4969
3             3    3      O   29               3                 6     902
4             4    4      O   34               6                 2    3574
..          ...  ...    ...  ...             ...               ...     ...
995         995  995      O   33               7                 7    2996
996         996  996      O   21               1                 2     667
997         997  997      O   49               9                 7    4158
998         998  998     AB   56               6                 7    2414
999         999  999      B   64               4                 9     788

[1000 rows x 7 columns]

In [4]:
data.head(7)

   Unnamed: 0  id groups  age  healthy_eating  active_lifestyle  salary
0           0   0      A   36               5                 5    2297
1           1   1      A   55               3                 5    1134
2           2   2      A   61               8                 1    4969
3           3   3      O   29               3                 6     902
4           4   4      O   34               6                 2    3574
5           5   5      O   42               5                 3    2761
6           6   6     AB   53               4                 6    1484

In [5]:
data.describe()

,Unnamed: 0,id,age,healthy_eating,active_lifestyle,salary
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000
mean,499.500000,499.500000,41.155000,4.944000,5.683000,2227.46100
std,288.819436,288.819436,13.462995,2.013186,2.048587,1080.20976
min,0.000000,0.000000,18.000000,0.000000,0.000000,553.00000
25%,249.750000,249.750000,30.000000,4.000000,4.000000,1360.00000
50%,499.500000,499.500000,41.000000,5.000000,6.000000,2174.00000
75%,749.250000,749.250000,53.000000,6.000000,7.000000,2993.75000
max,999.000000,999.000000,64.000000,10.000000,10.000000,5550.00000

In [6]:
#Mean

In [7]:
data.mean()

C:\Users\Dell\AppData\Local\Temp\ipykernel_19664\531903386.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.mean()

Unnamed: 0           499.500
id                   499.500
age                   41.155
healthy_eating         4.944
active_lifestyle       5.683
salary              2227.461
dtype: float64

In [8]:
data['age'].mean()

41.155

In [9]:
data.mean(axis=1)[0:4]

C:\Users\Dell\AppData\Local\Temp\ipykernel_19664\1453274113.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean(axis=1)[0:4]

0    390.500000
1    199.833333
2    840.500000
3    157.666667
dtype: float64

In [10]:
#Median

In [11]:
data.median()

C:\Users\Dell\AppData\Local\Temp\ipykernel_19664\4184645713.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.median()

Unnamed: 0           499.5
id                   499.5
age                   41.0
healthy_eating         5.0
active_lifestyle       6.0
salary              2174.0
dtype: float64

In [12]:
data['age'].median()

41.0

In [13]:
data.median(axis=1)[0:4]

C:\Users\Dell\AppData\Local\Temp\ipykernel_19664\2559795713.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.median(axis=1)[0:4]

0    5.0
1    4.0
2    5.0
3    4.5
dtype: float64

In [14]:
#Mode

In [15]:
data.mode()

     Unnamed: 0   id groups   age  healthy_eating  active_lifestyle  salary
0             0    0      A  62.0             5.0               6.0  2646.0
1             1    1      O   NaN             NaN               NaN     NaN
2             2    2    NaN   NaN             NaN               NaN     NaN
3             3    3    NaN   NaN             NaN               NaN     NaN
4             4    4    NaN   NaN             NaN               NaN     NaN
..          ...  ...    ...   ...             ...               ...     ...
995         995  995    NaN   NaN             NaN               NaN     NaN
996         996  996    NaN   NaN             NaN               NaN     NaN
997         997  997    NaN   NaN             NaN               NaN     NaN
998         998  998    NaN   NaN             NaN               NaN     NaN
999         999  999    NaN   NaN             NaN               NaN     NaN

[1000 rows x 7 columns]

In [16]:
data['age'].mode()

0    62
Name: age, dtype: int64

In [17]:
#Minimum

In [18]:
data.min()

Unnamed: 0            0
id                    0
groups                A
age                  18
healthy_eating        0
active_lifestyle      0
salary              553
dtype: object

In [19]:
data['age'].min()

18

In [20]:
#Maximum

In [21]:
data.max()

Unnamed: 0           999
id                   999
groups                 O
age                   64
healthy_eating        10
active_lifestyle      10
salary              5550
dtype: object

In [22]:
data['age'].max()

64

In [23]:
#Standard Deviation

In [24]:
data.std()

C:\Users\Dell\AppData\Local\Temp\ipykernel_19664\2723740006.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  data.std()

Unnamed: 0           288.819436
id                   288.819436
age                   13.462995
healthy_eating         2.013186
active_lifestyle       2.048587
salary              1080.209760
dtype: float64

In [25]:
data['age'].std()

13.46299473472478

In [26]:
data.std(axis=1)[0:4]

C:\Users\Dell\AppData\Local\Temp\ipykernel_19664\1389220895.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.std(axis=1)[0:4]

0     934.089236
1     458.130294
2    2022.677112
3     364.789071
dtype: float64

In [27]:
data.groupby(['groups'])['age'].std()

groups
A     13.681507
AB    14.415194
B     13.324036
O     12.930913
Name: age, dtype: float64

In [28]:
data.groupby(['groups'])['age'].mean()

groups
A     41.029333
AB    42.976000
B     42.048000
O     40.376000
Name: age, dtype: float64

In [29]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_data = pd.DataFrame(enc.fit_transform(data[['groups']]).toarray())
enc_data

       0    1    2    3
0    1.0  0.0  0.0  0.0
1    1.0  0.0  0.0  0.0
2    1.0  0.0  0.0  0.0
3    0.0  0.0  0.0  1.0
4    0.0  0.0  0.0  1.0
..   ...  ...  ...  ...
995  0.0  0.0  0.0  1.0
996  0.0  0.0  0.0  1.0
997  0.0  0.0  0.0  1.0
998  0.0  1.0  0.0  0.0
999  0.0  0.0  1.0  0.0

[1000 rows x 4 columns]

# PART B

In [30]:
import pandas as pd
import numpy as np

In [31]:
iris = pd.read_csv('iris.csv')

In [32]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [33]:
irisSet = (iris['Species']== 'Iris-setosa')

In [34]:
print('Iris-setosa')
print(iris[irisSet].describe())

Iris-setosa
             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

In [35]:
irisVer = (iris['Species']== 'Iris-versicolor')

In [36]:
print('Iris-versicolor')
print(iris[irisVer].describe())

Iris-versicolor
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

In [37]:
irisVir = (iris['Species']== 'Iris-virginica')

In [38]:
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-virginica
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000